app/services/payloads/create_reservation.rb

    def create_reservation
      guest = transform_guest_payload
      reservation = Reservation.new(reservation_params)

      failure(reservation.errors.full_messages.join(", ")) unless reservation.valid? && reservation.persisted?
      failure("Guest is invalid") if guest.blank?

      reservation.guests << guest
      reservation.save!
---
INSERT INTO "reservation_guests" ("reservation_id", "guest_id", "created_at", "updated_at") VALUES (1, 1, '2025-12-01 07:10:01.018983', '2025-12-01 07:10:01.018983') RETURNING "id"
INSERT INTO "reservations" ("start_date", "end_date", "no_of_nights", "no_of_guests", "adults", "infants", "children", "status", "currency", "payout_price", "security_price", "total_price", "created_at", "updated_at") VALUES ('2021-03-12', '2021-03-16', 4, 4, 2, 0, 2, 'accepted', NULL, 3800.0, 500.0, 4500.0, '2025-12-01 07:10:00.996110', '2025-12-01 07:10:00.996110') RETURNING "id"