app/services/payloads/retrieve_guest.rb

INSERT INTO "guests" ("first_name", "last_name", "phone", "email", "created_at", "updated_at") VALUES ('Wayne', 'Woodbridge', '{639123456789,639123456789}', 'wayne_woodbridge@bnb.com', '2025-12-01 07:10:00.894560', '2025-12-01 07:10:00.894560') RETURNING "id"
---
    def guest
      return find_guest if find_guest.present?

      g = Guest.create(guest_params)

SELECT "guests".* FROM "guests" WHERE "guests"."email" = 'wayne_woodbridge@bnb.com' LIMIT 1
---
    def find_guest
      Guest.find_by(email: payload_params[:guest][:email])